Tekla Open API Reference for Tekla Structures 2025
Distance.TryParse Method
Overload List
Name | Description
TryParse(String, Distance)
 Attempts to parse a distance from a string representation using the current units.
TryParse(String, IFormatProvider, Distance)
 Attempts to parse a distance from a string representation using the current units.
TryParse(String, IFormatProvider, Distance.UnitType, Distance)
 Attempts to parse a distance from a string representation using the current units.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace